app/views/events/_new.html.erb

        <%= form_tag "/event/newish", method: :get, remote: true, id: 'new_event_type_link' do %>
          <%= select_tag :event_type_id, options_from_collection_for_select(EventType.all.order(:name), :id, :name) %>
---
SELECT "event_types".* FROM "event_types" ORDER BY "event_types"."name" ASC