app/views/static/suivi.html.erb

SELECT  "rapports".* FROM "rapports" WHERE "rapports"."machine_id" = ? ORDER BY "rapports"."id" DESC LIMIT ?  [["machine_id", 1], ["LIMIT", 1]]
---
                <%= link_to "#{m.name} - #{m.last_week}", new_machine_rapport_path(m.id), class:"btn btn-default", style: "width:70%;" %>
                <%= link_to "Modifier", edit_machine_rapport_path(m, m.rapports.last.id), class:"btn btn-default", style:"width:20%;" if m.rapports.exists?%>

SELECT  "stocks".* FROM "stocks" ORDER BY "stocks"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
            <%= link_to "Etat du stock - #{@stock_last_week}", new_stock_path, class:"btn btn-default", style:"width:80%;" %>
            <%= link_to "Modifier", edit_stock_path(Stock.last.id), class:"btn btn-default", style:"width:20%;" if Stock.exists? %>

SELECT  "backlogs".* FROM "backlogs" ORDER BY "backlogs"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
            <%= link_to "Consommables et pièces - #{@backlog_last_week}", new_backlog_path, class:"btn btn-default", style:"width:80%;" %>
            <%= link_to "Modifier", edit_backlog_path(Backlog.last.id), class:"btn btn-default", style:"width:20%;" if Backlog.exists? %>