app/views/static/suivi.pdf.erb


<% Machine.all.each_slice(2) do |a, b|%>
---
SELECT "machines".* FROM "machines"