app/controllers/calendars_controller.rb

SELECT "calendars".* FROM "calendars"
---
  def index
    @calendars = Calendar.all

INSERT INTO "calendars" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Versalis"], ["created_at", "2018-06-25 07:51:25.774833"], ["updated_at", "2018-06-25 07:51:25.774833"]]
---
  def create
    @calendar = Calendar.new(calendar_params)

    if @calendar.save

SELECT  "calendars".* FROM "calendars" WHERE "calendars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_calendar
      @calendar = Calendar.find(params[:id])