app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE "events"."calendar_id" = ? AND ("events"."start" BETWEEN ? AND ?)  [["calendar_id", 1], ["start", "2018-06-15"], ["start", "2018-07-01"]]
---
  def index
    @events = Event.where(calendar_id: $calendar_id, start: (params[:start].to_date-7)..params[:end].to_date)

INSERT INTO "events" ("title", "start", "end", "color", "created_at", "updated_at", "calendar_id", "team_id", "event_type_id", "properties") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(event_params)
    if @event.save

UPDATE "events" SET "properties" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["properties", "--- !ruby/hash:ActiveSupport::HashWithIndifferentAccess\nPièce: Convoyeur\nNotes: Pb montage\n"], ["updated_at", "2018-06-25 07:52:24.417887"], ["id", 3]]
---
  def update
    if @event.update(event_params)