app/controllers/machines_controller.rb

INSERT INTO "machines" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Test"], ["created_at", "2018-06-21 12:30:51.852956"], ["updated_at", "2018-06-21 12:30:51.852956"]]
---
  def create
    @machine = Machine.new(machine_params)

    if @machine.save