app/controllers/rapports_controller.rb

  def create
    @rapport = Rapport.new(rapport_params)

    if !Rapport.where(machine_id: @rapport.machine_id, week: @rapport.week).blank?
      Rapport.where(machine_id: @rapport.machine_id, week: @rapport.week, created_at: (Date.today-6.months)..Date.today.end_of_day).take.delete
    end

    if @rapport.save
---
SELECT  "machines".* FROM "machines" WHERE "machines"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "rapports".* FROM "rapports" WHERE "rapports"."machine_id" = ? ORDER BY "rapports"."id" DESC LIMIT ?  [["machine_id", 6], ["LIMIT", 1]]
INSERT INTO "rapports" ("cas", "pdp", "cta", "dav", "dsa", "machine_id", "created_at", "updated_at", "week", "quart", "next_cas", "next_pdp") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_rapport
      @rapport = @machine.rapports.find(params[:id])
---
SELECT  "rapports".* FROM "rapports" WHERE "rapports"."machine_id" = ? ORDER BY "rapports"."id" DESC LIMIT ?  [["machine_id", 6], ["LIMIT", 1]]

    def set_machine
      @machine = Machine.find(params[:machine_id])
---
SELECT  "machines".* FROM "machines" WHERE "machines"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]