app/controllers/static_controller.rb

SELECT "stocks".* FROM "stocks" WHERE "stocks"."quart" = ? AND ("stocks"."created_at" BETWEEN ? AND ?)  [["quart", 2], ["created_at", "2018-02-21"], ["created_at", "2018-06-28"]]
SELECT "backlogs".* FROM "backlogs" WHERE "backlogs"."quart" = ? AND ("backlogs"."created_at" BETWEEN ? AND ?)  [["quart", 2], ["created_at", "2018-02-21"], ["created_at", "2018-06-28"]]
SELECT "machines".* FROM "machines"
---
  def suivi
    respond_to do |format|

      format.html {
        # Date range

        date_range = []
        dates = Date.commercial(Date.today.year, (Date.today.beginning_of_quarter+7.days).cweek, 3).cweek..Date.today.end_of_quarter.cweek
        dates.each{ |s| date_range << "S#{s}"}
        @range = "'#{date_range.join("','")}'"

        @nb_semaine = dates.count


        ## Button Last Week ##
        @stock_last_week = Stock.last ? Stock.last.week.to_s : "Pas de données"
        @backlog_last_week = Backlog.last ? Backlog.last.week.to_s : "Pas de données"

        @machines = Machine.all