app/controllers/teams_controller.rb

  def index
    @teams = Team.where(calendar_id: $calendar_id )
---
SELECT "teams".* FROM "teams" WHERE "teams"."calendar_id" = ?  [["calendar_id", 1]]

  def create
    @team = Team.new(team_params)

    respond_to do |format|
      if @team.save
          @team.users.create([{name: 'Non assigné'}, {name: 'Non assigné'}])
---
INSERT INTO "teams" ("name", "created_at", "updated_at", "calendar_id") VALUES (?, ?, ?, ?)  [["name", "Dac"], ["created_at", "2018-06-21 12:15:11.839199"], ["updated_at", "2018-06-21 12:15:11.839199"], ["calendar_id", 1]]
INSERT INTO "users" ("name", "team_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Non assigné"], ["team_id", 6], ["created_at", "2018-06-21 12:15:11.842999"], ["updated_at", "2018-06-21 12:15:11.842999"]]