app/views/rapports/_form.html.erb

SELECT  "rapports".* FROM "rapports" WHERE "rapports"."machine_id" = ? ORDER BY "rapports"."id" DESC LIMIT ?  [["machine_id", 6], ["LIMIT", 1]]
---
    <%= f.input :week, label: "Numéro de semaine", input_html: { value: Date.today.cweek-1 } %>
    <%= f.input :pdp, label: "PDP", input_html: { value: Rapport.where(machine_id: params[:machine_id]).last.pdp } %>